assignments/assignment-00.tex
% Created 2015-01-21 Wed 09:51
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{fixltx2e}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{float}
\usepackage{wrapfig}
\usepackage{soul}
\usepackage{textcomp}
\usepackage{marvosym}
\usepackage{wasysym}
\usepackage{latexsym}
\usepackage{amssymb}
\usepackage{hyperref}
\tolerance=1000
\providecommand{\alert}[1]{\textbf{#1}}

\title{Assignment 00}
\author{CSci 515 Spring 2015}
\date{2015-01-20}
\hypersetup{
  pdfkeywords={},
  pdfsubject={Assignment 00},
  pdfcreator={Emacs Org-mode version 7.9.3f}}

\begin{document}

\maketitle

\section*{Objective}
\label{sec-1}


In this assignment, you need to demonstrate the use of basic data
types of C, and practice using stream I/O to get and display data on
the terminal.

Write a complete C program that uses all of the following data types
(see Deitel chapter 6, pg. 218 for a complete list):

\begin{itemize}
\item int
\item char
\item short
\item long
\item float
\item double
\item unsigned
\item bool
\end{itemize}

You should prompt the user to enter an appropriate value that can be
stored in the type, and then you should perform some manipulation of
the type and display the result.
\section*{Lab Submission}
\label{sec-2}

On the day of the lab, you simply need to complete a demonstration of
getting an int data type and then manipulating the int and displaying
the result after performing your calculation.  Your program needs to
be completed in class, and should be uploaded to the Lab-00 dropbox on
our eCollege submission system.
\section*{Programming Submission}
\label{sec-3}

Then, by the end of next Tuesday (1/27), you need to complete your
program as specified above to demonstrate using all of the required
list of data types to input a value and display a result of a
manipulation.  Your completed program should be uploaded to the
eCollege dropbox named Prog-00 for this course.
\section*{Requirements}
\label{sec-4}

Your programs must conform to the style and formatting guidelines
given for this course.  In particular, you should have a program
header in your file (with your name, cwid, date, description,
etc. information).  In addition, though your program will only consist
of a single \verb~main()~ function, I want you to get into the habit of
providing function documentation as well.  You may use the following
function documentation for basic \verb~main()~ functions for the initial
programming assignments for this course.


\begin{minted}[]{c}

/** program entry point
 * The main entry point of the program.  Execution of the program
 * will begin in this function.
 *
 * @returns an int 0 for successful program completion.
 */
int main()
{
    // programming assignment implementation goes here
}
\end{minted}

\end{document}
